dmatking/m5stack-tab5-gps/sdkconfig.defaults
# Target: ESP32-P4 v1.x (Tab5 ships with v1.3)
# SELECTS_REV_LESS_V3 is required — REV_MIN_* options depend on it
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Lets flash erase/program ops suspend when the CPU needs the bus instead of
# blocking interrupts for the whole operation -- prevents the MIPI-DSI frame
# DMA from missing its per-frame re-arm and underrunning (blue/cyan flash).
# See m5stack-tab5-ssh-terminal's OTA work for the original diagnosis.
CONFIG_SPI_FLASH_AUTO_SUSPEND=y

# Custom partition table -- adds a "tiledata" raw partition holding
# pre-converted RGB565 map tiles (see partitions.csv, main/tile_flash.c)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU (360 MHz)
CONFIG_ESP_DEFAULT_CPU_FREQ_360=y
CONFIG_FREERTOS_HZ=1000

# Console — UART primary, USB JTAG secondary
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# TinyUSB mass-storage (main/usb_msc.c) -- exposes the microSD card as a
# USB drive over the USB-A/OTG port, gated at runtime behind USB_MSC_MODE
# (see main.cmake.extra); the driver itself must still be enabled here to
# compile in either build.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_FATFS_LFN_HEAP=y

# PSRAM (HEX mode, 200 MHz)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# LVGL (main/ui_shell.c -- splash/menu/settings screens, map screen stays
# native). Same settings verified working on this board/panel in
# m5stack-tab5-lvgl-primer.
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set

# main/mockup_viewer.c: full-screen mockup images read straight off the SD
# card as raw RGB565 (see that file's header comment -- LVGL's PNG decoder
# path was tried first and abandoned after real memory problems on real
# hardware). No PNG decoder or LVGL filesystem driver needed as a result --
# the app reads the files itself via plain fopen()/fread() and hands LVGL
# an LV_IMAGE_SRC_VARIABLE, which flash is thin enough to appreciate not
# paying for (this app partition was down to 4-5% free with both enabled).

# Surfaces LVGL's own internal errors on the
# console instead of failing completely silently -- was off by default,
# which is why the mockup PNGs not loading produced zero diagnostic output.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y

# LVGL's default allocator (LV_USE_BUILTIN_MALLOC) is its own tiny internal
# pool, LV_MEM_SIZE_KILOBYTES=64 by default -- totally separate from
# ESP-IDF's heap/PSRAM. A 720x1280 PNG decodes to ~3.6MB (LodePNG always
# decodes to ARGB8888); confirmed on real hardware that this fails with
# "error 83: memory allocation failed" against a 64KB pool, no matter how
# much real PSRAM is free. CLIB_MALLOC routes lv_malloc() through plain
# malloc()/free(), which -- thanks to CONFIG_SPIRAM_USE_MALLOC above --
# transparently spills anything past CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL
# into PSRAM, same as any other large ESP-IDF allocation in this project.
CONFIG_LV_USE_CLIB_MALLOC=y
